In [12]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
pd.set_option("display.max_columns",None)
pd.set_option("display.max_rows",None)
import plotly.express as px
pd.set_option('display.float_format', lambda x: '%.5f' % x)

In [2]:
names = pd.read_csv('./Data/names_ranks_counts.csv')

In [3]:
names.head()

   name sex  year  rank  count
0  John   M  1880   1.0   9655
1  Mary   F  1880   1.0   7065
2  John   M  1881   1.0   8769
3  Mary   F  1881   1.0   6919
4  John   M  1882   1.0   9557

In [4]:
names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2020863 entries, 0 to 2020862
Data columns (total 5 columns):
 #   Column  Dtype
---  ------  -----
 0   name    object
 1   sex     object
 2   year    int64
 3   rank    float64
 4   count   int64
dtypes: float64(1), int64(2), object(2)
memory usage: 77.1+ MB

In [5]:
names['year'] = pd.to_datetime(names["year"], format = '%Y')

In [6]:
names.set_index("year", inplace=True)
names.sort_index(inplace=True)

In [7]:
names.head()

                  name sex   rank  count
year
1880-01-01        John   M    1.0   9655
1880-01-01      Delila   F  836.0      5
1880-01-01     Corrine   F  836.0      5
1880-01-01    Cordella   F  836.0      5
1880-01-01  Concepcion   F  836.0      5

In [8]:
names.shape

(2020863, 4)

### Lots of "little" ones--infrequent occurring names pushing the 1st and 3rd quartile counts down

In [13]:
names.describe()

               rank         count
count 2020863.00000 2020863.00000
mean     5258.44697     177.38991
std      4220.12931    1502.47071
min         1.00000       5.00000
25%      1865.00000       7.00000
50%      4046.00000      12.00000
75%      7994.00000      32.00000
max     17632.00000   99693.00000

### Split up Data by Gender

In [14]:

male_names = names[names["sex"]=="M"]
female_names = names[names["sex"]=="F"]

In [15]:
male_names.to_csv('./Data/male_names.csv')
female_names.to_csv('./Data/female_names.csv')

### As noted with the full data above--lots of little ones pushing numbers down

In [16]:
male_names.describe()

              rank        count
count 828748.00000 828748.00000
mean    4169.36497    218.52507
std     3300.27558   1889.48120
min        1.00000      5.00000
25%     1514.00000      7.00000
50%     3307.00000     12.00000
75%     6233.00000     33.00000
max    12543.00000  94764.00000

In [17]:
female_names.describe()

               rank         count
count 1192115.00000 1192115.00000
mean     6015.56732     148.79310
std      4606.60524    1158.80721
min         1.00000       5.00000
25%      2193.00000       7.00000
50%      4808.00000      12.00000
75%      9232.00000      31.00000
max     17632.00000   99693.00000

### Split up Data by Gender with names over 99 mentions in a year

In [18]:
names_100 = names[names["count"]>99]

In [19]:
male_names_100 = names_100[names_100["sex"]=="M"]
female_names_100 = names_100[names_100["sex"]=="F"]

In [20]:
male_names_100.to_csv('./Data/male_names_100.csv')
female_names_100.to_csv('./Data/female_names_100.csv')

In [21]:
male_names_100.describe()

              rank        count
count 104080.00000 104080.00000
mean     498.52584   1616.74001
std      375.70977   5117.58720
min        1.00000    100.00000
25%      192.75000    161.00000
50%      430.00000    323.00000
75%      704.00000    949.00000
max     1630.00000  94764.00000

In [22]:
female_names_100.describe()

              rank        count
count 138179.00000 138179.00000
mean     650.13562   1151.12533
std      483.71618   3232.06612
min        1.00000    100.00000
25%      250.00000    155.00000
50%      554.00000    288.00000
75%      957.00000    799.00000
max     2053.00000  99693.00000

### Split up Data further--at least 100 mentions from 1920 to 2020 (drop 1880-1919 years)

In [23]:
males100_1920 = male_names_100["1920":]

In [24]:
females100_1920 = female_names_100["1920":]

In [25]:
males100_1920.to_csv('./Data/males100_100.csv')
females100_1920.to_csv('./Data/females100_100.csv')

In [26]:
males100_1920.describe()

             rank       count
count 94573.00000 94573.00000
mean    531.57870  1683.20861
std     375.69260  5290.88984
min       1.00000   100.00000
25%     234.00000   162.00000
50%     468.00000   329.00000
75%     739.00000   994.00000
max    1630.00000 94764.00000

In [27]:
females100_1920.describe()

              rank        count
count 124388.00000 124388.00000
mean     698.96184   1172.77769
std      482.90444   3315.64249
min        1.00000    100.00000
25%      308.00000    154.00000
50%      615.50000    285.00000
75%     1009.00000    788.00000
max     2053.00000  99693.00000

### Data for all mentions (of at least 5) from 1921 to 2020

In [29]:
males_1920 = male_names["1920":]
females_1920 = female_names["1920":]

In [30]:
males_1920.to_csv('./Data/males_1920.csv')
females_1920.to_csv('./Data/females_1920.csv')

In [31]:
males_1920.describe()

              rank        count
count 754390.00000 754390.00000
mean    4456.47468    226.45186
std     3306.00821   1952.89433
min        1.00000      5.00000
25%     1843.00000      7.00000
50%     3594.00000     12.00000
75%     6528.00000     33.00000
max    12543.00000  94764.00000

In [32]:
females_1920.describe()

               rank         count
count 1097020.00000 1097020.00000
mean     6408.46946     148.36590
std      4582.91740    1175.16308
min         1.00000       5.00000
25%      2674.00000       7.00000
50%      5286.00000      11.00000
75%      9652.00000      30.00000
max     17632.00000   99693.00000

### Data for mentions of at least 100 times for at least 10 years (non-consecutively)

In [33]:
names_list_big_males = male_names_100["name"].unique().tolist()
names_list_big_females = female_names_100["name"].unique().tolist()

In [34]:
grouping = {}
group_list =[]
def name_ten_years(names,df):
    for name in names:
        
        Z=df[df["name"]==name][["count"]]
        
        grouping.update({name:Z.shape[0]})
    
        
    for k,v in sorted(grouping.items(), key=lambda x:x[1],reverse=True):
        if v <=10:
            group_list.append(k)
    
        df_dropped = df[~df["name"].isin(group_list)]
    
    return df_dropped

In [35]:
new_data_males = name_ten_years(names_list_big_males, male_names_100)

In [36]:
new_data_females = name_ten_years(names_list_big_females, female_names_100)

In [37]:
new_data_males.to_csv('./Data/males_100count_10years.csv')
new_data_females.to_csv('./Data/females_100count_10years.csv')

In [38]:
new_data_males.describe()

             rank       count
count 99589.00000 99589.00000
mean    469.77231  1682.93825
std     351.34149  5221.93879
min       1.00000   100.00000
25%     183.00000   171.00000
50%     410.00000   346.00000
75%     664.00000  1016.00000
max    1630.00000 94764.00000

In [39]:
new_data_females.describe()

              rank        count
count 125881.00000 125881.00000
mean     615.57345   1118.86041
std      454.63263   3083.23760
min        1.00000    100.00000
25%      243.00000    164.00000
50%      526.00000    306.00000
75%      898.00000    828.00000
max     2053.00000  99693.00000

### Data for mentions of at least 100 times for at least 10 years (non consecutively) from 1920-2020

In [28]:
name_list_males=males100_1920["name"].unique().tolist()
name_list_females = females100_1920["name"].unique().tolist()

In [29]:
new_data_males_2 = name_ten_years(name_list_males, males100_1920)
new_data_females_2 = name_ten_years(name_list_females, females100_1920)

In [30]:
new_data_males_2.to_csv('./Data/males_100count_10years_1920.csv')
new_data_females_2.to_csv('./Data/females_100count_10years_1920.csv')

In [31]:
new_data_males_2["name"].nunique()

1873

In [32]:
new_data_females_2["name"].nunique()

2948

In [41]:
males=pd.read_csv('./Data/males_100count_10years_1920.csv', parse_dates =['year'], index_col="year")
females=pd.read_csv('./Data/females_100count_10years_1920.csv', parse_dates =['year'], index_col="year")

In [43]:
males.describe()

             rank       count
count 85026.00000 85026.00000
mean    508.38977  1645.40242
std     350.14712  5353.09091
min       1.00000   100.00000
25%     234.00000   172.00000
50%     453.00000   346.00000
75%     705.00000   993.00000
max    1630.00000 94764.00000

In [44]:
females.describe()

              rank        count
count 112086.00000 112086.00000
mean     663.40415   1141.38599
std      454.91304   3161.93135
min        1.00000    100.00000
25%      298.00000    165.00000
50%      586.00000    306.00000
75%      952.00000    825.00000
max     2053.00000  99693.00000

In [54]:
males[males["count"]>=993].count()

name     21264
sex      21264
rank     21264
count    21264
dtype: int64

In [57]:
females[females['count']>=825].count()

name     28036
sex      28036
rank     28036
count    28036
dtype: int64

### Split up by very popular names (75th percentile and over) for at least 100 counts for 10 years 1920-2020

In [58]:
popular_males = males[males["count"]>=993]
popular_females = females[females["count"]>=825]

In [59]:
popular_males.to_csv('./Data/popular_males.csv')
popular_females.to_csv('./Data/popular_females.csv')

In [60]:
popular_males["name"].nunique()

649

In [61]:
popular_females["name"].nunique()

1058

In [62]:
popular_males.describe()

             rank       count
count 21264.00000 21264.00000
mean    128.23326  5619.63972
std      78.96062  9663.26733
min       1.00000   993.00000
25%      64.00000  1488.00000
50%     122.00000  2436.00000
75%     185.00000  5070.50000
max     347.00000 94764.00000

In [63]:
popular_females.describe()

             rank       count
count 28036.00000 28036.00000
mean    159.10269  3710.40876
std      94.12979  5574.32114
min       1.00000   825.00000
25%      81.00000  1181.00000
50%     154.00000  1930.00000
75%     229.00000  3862.00000
max     402.00000 99693.00000